danngreen/STM32DDRFW-UTIL/DDR_Tool/Common_MP2/Src/ddr_tests.c
/**
  ******************************************************************************
  * @file    ddr_tests.c
  * @author  MCD Application Team
  * @brief   This file provides all the HAL DDR test functions.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32_device_hal.h"

#include "stdio.h"
#include "stdlib.h"
#include "string.h"
#include "log.h"
#include "ddr_tests.h"

#include "stm32mp_util_conf.h"
#include "stm32mp_util_ddr_conf.h"

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
#define DDR_BASE_ADDR                        0x80000000

/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
bool silent_console = false;
char remote_argv0[20] = "\0";
char remote_argv1[20] = "\0";
int remote_argc = 0;
int remote_cmd = 0;
uint32_t remote_impedance = 0;

uint32_t save_test_id = 0;
uint32_t save_idx = 0;
uint32_t save_zphy_idx = 0;
uint32_t initial_zphy = 0;
uint32_t save_zmem_idx = 0;
uint32_t initial_zmem = 0;
uint32_t stage_in_test = 0;
uint32_t back_to_test = 0;
bool initial_done = false;

/* Private function prototypes -----------------------------------------------*/
/* Private functions ---------------------------------------------------------*/
static int get_addr(unsigned long addr_in, uintptr_t **addr)
{
  if (addr_in != 0UL)
  {
    if (addr_in < DDR_MEM_BASE)
    {
      if (!silent_console)
      {
        printf("Address too low: 0x%lx\n\r", addr_in);
      }
      return -1;
    }

    if ((addr_in & 0x3UL) != 0UL)
    {
      if (!silent_console)
      {
        printf("Unaligned address: 0x%lx\n\r", addr_in);
      }
      return -1;
    }

    *addr = (uintptr_t *)addr_in;
  }
  else
  {
    *addr = (uintptr_t *)DDR_MEM_BASE;
  }

  return 0;
}

static void get_nb_loop(unsigned long loop_in, uint32_t *nb_loop,
                        uint32_t default_nb_loop)
{
  if (loop_in != 0)
  {
    if (loop_in == 0xFFFFFFFF)
    {
      if (!silent_console)
      {
        printf("Warning: infinite loop requested\n\r");
      }
    }

    if (loop_in > 0xFFFFFFFF)
    {
      if (!silent_console)
      {
        printf("Warning: incorrect loop_number, forced to default value\n\r");
      }
      *nb_loop = default_nb_loop;
    }
    else
    {
      *nb_loop = (uint32_t)loop_in;
    }
  }
  else
  {
    *nb_loop = default_nb_loop;
  }
}

static int get_buf_size(unsigned long size_in, unsigned long *size,
                        unsigned long default_size, unsigned long min_size)
{
  if (size_in != 0)
  {
    if ((size_in < min_size) || (size_in > (unsigned long)DDR_MEM_SIZE))
    {
      if (!silent_console)
      {
        printf("Invalid size: 0x%lx\n\r", size_in);
        printf("  (range = 0x%lx..0x%lx)\n\r", min_size, (unsigned long)DDR_MEM_SIZE);
      }
      return -1;
    }

    if ((size_in & (min_size - 1)) != 0)
    {
      if (!silent_console)
      {
        printf("Unaligned size: 0x%lx (min=0x%lx)\n\r", size_in, min_size);
      }
      return -1;
    }

    *size = size_in;
  }
  else
  {
    *size = default_size;
  }

  return 0;
}

static bool is_power_of_2(unsigned long n)
{
  return ((n != 0) && ((n & (n - 1)) == 0));
}

static void get_pattern(unsigned long pattern_in, unsigned long *pattern,
		unsigned long default_pattern)
{
  if (pattern_in != 0)
  {
    *pattern = pattern_in;
  }
  else
  {
    *pattern = default_pattern;
  }
}

static int test_loop_end(uint32_t *loop, uint32_t nb_loop)
{
  (*loop)++;
  if (nb_loop && *loop >= nb_loop)
  {
    return 1;
  }

  return 0;
}

/**
* @brief test_databus.
* @par Test Description
*   Verifies each data line by walking 1 on fixed address.
*   Test the data bus wiring in a memory region by performing
*   a walking 1's test at a fixed address within that region.
* @par Test Hardware Connection
* - None
* @par Required preconditions
* - None
* @par Expected result
* - None
* @par Called functions
* - None
* @par Used Peripherals
* - None,...
* @retval
*  0: Test passed
*  Value different from 0: Test failed
*  None(0xFF): if the result is deduced by the user: waveform, event...
*/
uint32_t DDR_Test_Databus(unsigned long addr_in)
{
  unsigned long pattern;
  uintptr_t *addr = NULL;

  if (get_addr(addr_in, &addr) != 0)
  {
    return 1;
  }

  for (pattern = 1U; pattern != 0U; pattern <<= 1)
  {
    *addr = pattern;

    if (*addr != pattern)
    {
      if (!silent_console)
      {
        printf("  %s KO @ 0x%lx \n\r", __func__,  (unsigned long)addr);
      }
      return 2;
    }
  }

  return 0;
}

static int test_databuswalk(uint8_t mode, unsigned long loop_in, unsigned long addr_in)
{
  int i;
  uintptr_t *addr = NULL;
  unsigned long data;
  unsigned long error = 0U;
  uint32_t loop = 0;
  uint32_t nb_loop;

  get_nb_loop(loop_in, &nb_loop, 100);

  if (get_addr(addr_in, &addr) != 0)
  {
    return 1;
  }

  while (error == 0U)
  {
    for (i = 0; i < (int)(sizeof(unsigned long) * 8); i++)
    {
      unsigned long pattern = mode ? (1 << i) : ~(1 << i);

      *(addr + sizeof(unsigned long) * i) = pattern;
    }

    for (i = 0; i < (int)(sizeof(unsigned long) * 8); i++)
    {
      unsigned long pattern = mode ? (1 << i) : ~(1 << i);

      data = *(addr + sizeof(unsigned long) * i);
      if (pattern !=  data)
      {
        error |= 1 << i;
        if (!silent_console)
        {
          printf("  0x%lx: error 0x%lx expected 0x%lx => error:0x%lx\n\r",
                 (unsigned long)(addr + sizeof(unsigned long) * i), data, pattern, error);
        }
      }
    }

    if (test_loop_end(&loop, nb_loop))
    {
      break;
    }

