danngreen/STM32DDRFW-UTIL/DDR_Tool/Common_MP2/Src/ddr_tests.c
    for (i = 0; i < (int)(sizeof(unsigned long) * 8); i++)
    {
      *(addr + sizeof(unsigned long) * i) = 0;
    }
  }

  if (error != 0U)
  {
    if (!silent_console)
    {
      printf("  %s%d KO\n\r", __func__, mode);
    }
    return 2;
  }

  return 0;
}

/**
* @brief test_databuswalk0.
* @par Test Description
*   Verifies each data bus signal can be driven low (32 word burst).
* @par Test Hardware Connection
* - None
* @par Required preconditions
* - None
* @par Expected result
* - None
* @par Called functions
* - xxx
* @par Used Peripherals
* - None,...
* @retval
*  0: Test passed
*  Value different from 0: Test failed
*  None(0xFF): if the result is deduced by the user: waveform, event...
*/
uint32_t DDR_Test_DatabusWalk0(unsigned long loop, unsigned long addr)
{
  return test_databuswalk(0, loop, addr);
}

/**
* @brief test_databuswalk1.
* @par Test Description
*   Verifies each data bus signal can be driven high (32 word burst).
* @par Test Hardware Connection
* - None
* @par Required preconditions
* - None
* @par Expected result
* - None
* @par Called functions
* - xxx
* @par Used Peripherals
* - None,...
* @retval
*  0: Test passed
*  Value different from 0: Test failed
*  None(0xFF): if the result is deduced by the user: waveform, event...
*/
uint32_t DDR_Test_DatabusWalk1(unsigned long loop, unsigned long addr)
{
  return test_databuswalk(1, loop, addr);
}

/**
* @brief test_addrbus.
* @par Test Description
*   Verifies each relevant bits of the address and checking for aliasing.
*   Test the address bus wiring in a memory region by performing
*   a walking 1's test on the relevant bits of the address and
*   checking for aliasing. This test will find single-bit address
*   failures such as stuck -high, stuck-low, and shorted pins.
*   For best results, the selected base address should have enough
*   LSB 0's to guarantee single address bit changes.  For example,
*   to test a 64-Kbyte region, select a base address on a 64-Kbyte
*   boundary.  Also, select the region size as a power-of-two
*   --if at all possible.
* @par Test Hardware Connection
* - None
* @par Required preconditions
* - None
* @par Expected result
* - None
* @par Called functions
* - xxx
* @par Used Peripherals
* - None,...
* @retval
*  0: Test passed
*  Value different from 0: Test failed
*  None(0xFF): if the result is deduced by the user: waveform, event...
*/
uint32_t DDR_Test_AddressBus(unsigned long size_in, unsigned long addr_in)
{
  uintptr_t *addr = NULL;
  unsigned long size;
  unsigned long dflt_size;
  unsigned long addressmask;
  unsigned long offset;
  unsigned long testoffset = 0;
  unsigned long pattern     = 0xAAAAAAAAAAAAAAAA;
  unsigned long antipattern = 0x5555555555555555;
  unsigned long data;

  if (!is_power_of_2(DDR_MEM_SIZE))
  {
    /* Get the bigger 2^n value of DDR_MEM_SIZE */
    if ((DDR_MEM_SIZE & 0x100000000) == 0x100000000)
    {
      dflt_size = 0x100000000;
    }
    else if ((DDR_MEM_SIZE & 0x80000000) == 0x80000000)
    {
      dflt_size = 0x80000000;
    }
    else if ((DDR_MEM_SIZE & 0x40000000) == 0x40000000)
    {
      dflt_size = 0x40000000;
    }
    else if ((DDR_MEM_SIZE & 0x20000000) == 0x20000000)
    {
      dflt_size = 0x20000000;
    }
    else if ((DDR_MEM_SIZE & 0x10000000) == 0x10000000)
    {
      dflt_size = 0x10000000;
    }
    else
    {
      if (!silent_console)
      {
        printf("DDR size too low for this test (0x%lx)\n\r",
               (unsigned long)DDR_MEM_SIZE);
      }
      return 2;
    }
  }
  else
  {
    dflt_size = DDR_MEM_SIZE;
  }

  if (get_buf_size(size_in, &size, dflt_size, sizeof(unsigned long)) != 0)
  {
    return 1;
  }

  if (!is_power_of_2(size))
  {
    if (!silent_console)
    {
      printf("size 0x%lx is not a power of 2\n\r", size);
    }
    return 2;
  }

  if (get_addr(addr_in, &addr) != 0)
  {
    return 3;
  }

  addressmask = size - 1;

  /* Write the default pattern at each of the power-of-two offsets. */
  for (offset = 1U;
       ((offset & addressmask) != 0U) &&
       ((offset * sizeof(unsigned long)) != dflt_size);
       offset <<= 1)
  {
    *(addr + offset) = pattern;
  }

  /* Check for address bits stuck high. */
  *(addr + testoffset) = antipattern;

  for (offset = 1U;
       ((offset & addressmask) != 0U) &&
       ((offset * sizeof(unsigned long)) != dflt_size);
       offset <<= 1)
  {
    data = *(addr + offset);
    if (data != pattern)
    {
      if (!silent_console)
      {
        printf("  %s KO @ 0x%lx \n\r", __func__, (unsigned long)(addr + offset));
        printf("  read 0x%lx instead of 0x%lx\n\r", data, pattern);
      }
      return 4;
    }
  }

  *(addr + testoffset) = pattern;

  /* Check for address bits stuck low or shorted. */
  for (testoffset = 1U;
       ((testoffset & addressmask) != 0U) &&
       ((testoffset * sizeof(unsigned long)) != dflt_size);
       testoffset <<= 1)
  {
    *(addr + testoffset) = antipattern;

    data = *addr;
    if (data != pattern)
    {
      if (!silent_console)
      {
        printf("  %s KO @ 0x%lx \n\r", __func__, (unsigned long)(addr + testoffset));
        printf("  read 0x%lx instead of 0x%lx\n\r", data, pattern);
      }
      return 5;
    }

    for (offset = 1U;
         ((offset & addressmask) != 0U) &&
         ((offset * sizeof(unsigned long)) != dflt_size);
         offset <<= 1)
    {
     data = *(addr + offset);
     if ((data != pattern) && (offset != testoffset))
      {
        if (!silent_console)
        {
          printf("  %s KO @ 0x%lx \n\r", __func__, (unsigned long)(addr + offset));
          printf("  read 0x%lx instead of 0x%lx\n\r", data, pattern);
        }
        return 6;
      }
    }

    *(addr + testoffset) = pattern;
  }

  return 0;
}

/**
* @brief test_memdevice.
* @par Test Description
*   Test the integrity of a physical memory device (test every storage
*   bit in the region) by performing an increment/decrement test over
*   the entire region. In the process every storage bit in the device
*   is tested as a zero and a one.
* @par Test Hardware Connection
* - None
* @par Required preconditions
* - None
* @par Expected result
* - None
* @par Called functions
* - xxx
* @par Used Peripherals
* - None,...
* @retval
*  0: Test passed
*  Value different from 0: Test failed
*  None(0xFF): if the result is deduced by the user: waveform, event...
*/
uint32_t DDR_Test_MemDevice(unsigned long size_in, unsigned long addr_in)
{
  uintptr_t *addr = NULL;
  unsigned long size;
  unsigned long nb_words;
  unsigned long offset;
  unsigned long pattern;
  unsigned long antipattern;

  if (get_buf_size(size_in, &size, 4 * 1024, sizeof(unsigned long)) != 0)
  {
    return 1;
  }

