danngreen/STM32DDRFW-UTIL/DDR_Tool/Common_MP2/Src/ddr_tests.c
  if (get_addr(addr_in, &addr) != 0)
  {
    return 2;
  }

  nb_words = size / sizeof(unsigned long);

  /* Fill memory with a known pattern. */
  for (pattern = 1, offset = 0; offset < nb_words;
       pattern++, offset += sizeof(unsigned long))
  {
    *(addr + offset) = pattern;
  }

  /* Check each location and invert it for the second pass. */
  for (pattern = 1, offset = 0; offset < nb_words;
       pattern++, offset += sizeof(unsigned long))
  {
    if (*(addr + offset) != pattern)
    {
      if (!silent_console)
      {
        printf("  %s KO @ 0x%lx \n\r", __func__, (unsigned long)(addr + offset));
      }
      return 3;
    }

    antipattern = ~pattern;
    *(addr + offset) = antipattern;
  }

  /* Check each location for the inverted pattern and zero it. */
  for (pattern = 1, offset = 0; offset < nb_words;
       pattern++, offset += sizeof(unsigned long))
  {
    antipattern = ~pattern;
    if (*(addr + offset) != antipattern)
    {
      if (!silent_console)
      {
        printf("  %s KO @ 0x%lx \n\r", __func__, (unsigned long)(addr + offset));
      }
      return 4;
    }
  }

  return 0;
}

/**
* @brief test_sso.
* @par Test Description
*   Test the Simultaneous Switching Output.
*   Verifies succes sive reads and writes to the same memory word,
*   holding one bit constant while toggling all other data bits
*   simultaneously
*   => stress the data bus over an address range
*   The CPU writes to each address in the given range.
*   For each bit, first the CPU holds the bit at 1 while toggling the
*   other bits, and then the CPU holds the bit at 0 while toggling
*   the other bits.
*   After each write, the CPU reads the address that was written
*   to verify that it contains the correct data.
* @par Test Hardware Connection
* - None
* @par Required preconditions
* - None
* @par Expected result
* - None
* @par Called functions
* - xxx
* @par Used Peripherals
* - None,...
* @retval
*  0: Test passed
*  Value different from 0: Test failed
*  None(0xFF): if the result is deduced by the user: waveform, event...
*/
uint32_t DDR_Test_SimultaneousSwitchingOutput(unsigned long size_in,
                                              unsigned long addr_in)
{
  int i, j;
  uintptr_t *addr = NULL;
  unsigned long size;
  unsigned long remaining;
  unsigned long offset;
  unsigned long data = 0;

  if (get_buf_size(size_in, &size, 4 * 1024, sizeof(unsigned long)) != 0)
  {
    return 1;
  }

  if (get_addr(addr_in, &addr) != 0)
  {
    return 2;
  }

  //printf("running sso at 0x%lx length 0x%lx\n\r", (uint32_t)addr, size);
  offset = 0;
  remaining = size;

  while (remaining) {
    for (i = 0; i < (int)(sizeof(unsigned long) * 8); i++) {
      /* write pattern. */
      for (j = 0; j < 6; j++) {
        switch (j)
        {
          case 0:
          case 2:
            data = 1 << i;
            break;
          case 3:
          case 5:
            data = ~(1 << i);
            break;
          case 1:
            data = ~0x0;
            break;
          case 4:
            data = 0x0;
            break;
        }

        *(addr + offset) = data;

        if (*(addr + offset) != data)
        {
          if (!silent_console)
          {
            printf("  %s KO @ 0x%lx \n\r", __func__, (unsigned long)(addr + offset));
          }
          return 3;
        }
      }
    }
    offset ++;
    remaining -= sizeof(unsigned long);
  }

  return 0;
}

static void do_noise(unsigned long addr, unsigned long pattern,
                     unsigned long *result)
{
  __asm volatile (
//                "PUSH {x2-x10}            \n"
                  "STP x2, x3, [sp, #-16]!  \n"
                  "STP x4, x5, [sp, #-16]!  \n"
                  "STP x6, x7, [sp, #-16]!  \n"
                  "STP x8, x9, [sp, #-16]!  \n"
                  "STP x10, x11, [sp, #-16]!\n"

                  "MOV x0, %[addr]          \n"
                  "MOV x1, %[pattern]       \n"
                  "MOV x12, %[result]       \n"

                  "MVN x2, x1               \n"

                  "STR x1, [x0]             \n"
                  "LDR x3, [x0]             \n"
                  "STR x2, [x0]             \n"
                  "LDR x4, [x0]             \n"

                  "STR x1, [x0]             \n"
                  "LDR x5, [x0]             \n"
                  "STR x2, [x0]             \n"
                  "LDR x6, [x0]             \n"

                  "STR x1, [x0]             \n"
                  "LDR x7, [x0]             \n"
                  "STR x2, [x0]             \n"
                  "LDR x8, [x0]             \n"

                  "STR x1, [x0]             \n"
                  "LDR x9, [x0]             \n"
                  "STR x2, [x0]             \n"
                  "LDR x10, [x0]            \n"

//                "STMIA x12!, {x3-x10}     \n"
                  "STP x3, x4, [x12], #16   \n"
                  "STP x5, x6, [x12], #16   \n"
                  "STP x7, x8, [x12], #16   \n"
                  "STP x9, x10, [x12], #16  \n"

//                "POP {x2-x10}             \n"
                  "LDP x2, x3, [sp], #16    \n"
                  "LDP x4, x5, [sp], #16    \n"
                  "LDP x6, x7, [sp], #16    \n"
                  "LDP x8, x9, [sp], #16    \n"
                  "LDP x10, x11, [sp], #16  \n"
                  ::[addr]    "r" (addr),
                    [pattern] "r" (pattern),
                    [result]  "r" (result)
                  : "x0", "x1", "x12");
}


/**
* @brief test_noise.
* @par Test Description
*   Verifies r/w while forcing switching of all data bus lines.
*   optimised 4 iteration write/read/write/read cycles...
*   for pattern and inversed pattern.
* @par Test Hardware Connection
* - None
* @par Required preconditions
* - None
* @par Expected result
* - None
* @par Called functions
* - xxx
* @par Used Peripherals
* - None,...
* @retval
*  0: Test passed
*  Value different from 0: Test failed
*  None(0xFF): if the result is deduced by the user: waveform, event...
*/
uint32_t DDR_Test_Noise(unsigned long pattern_in, unsigned long addr_in)
{
  unsigned long pattern;
  unsigned long dflt_pattern = 0xFFFFFFFFFFFFFFFF;
  uintptr_t *addr = NULL;
  unsigned long result[8] = {0,0,0,0,0,0,0,0};
  int i;

  get_pattern(pattern_in, &pattern, dflt_pattern);

