danngreen/STM32DDRFW-UTIL/DDR_Tool/Common_MP2/Src/ddr_tests.c
  if (get_addr(addr_in, &addr) != 0)
  {
    return 1;
  }

  do_noise((unsigned long)addr, pattern, result);

  for (i = 0; i < 8;)
  {
    if (*(&result[i++]) != pattern)
    {
      if (!silent_console)
      {
        printf("  %s KO @ 0x%lx \n\r", __func__, result[i - 1]);
      }
      return 2;
    }

    if (*(&result[i++]) != ~pattern)
    {
      if (!silent_console)
      {
        printf("  %s KO @ 0x%lx \n\r", __func__, result[i - 1]);
      }
      return 3;
    }
  }

  return 0;
}

static void do_noiseburst(unsigned long addr, unsigned long pattern,
                          unsigned long bufsize)
{
  __asm volatile (
//                "PUSH {x2-x8}             \n"
                  "STP x2, x3, [sp, #-16]!  \n"
                  "STP x4, x5, [sp, #-16]!  \n"
                  "STP x6, x7, [sp, #-16]!  \n"
                  "STP x8, x9, [sp, #-16]!  \n"

                  "MOV x0, %[addr]          \n"
                  "MOV x1, %[pattern]       \n"
                  "MOV x10, %[bufsize]      \n"

                  "MVN x2, x1               \n"
                  "MOV x3, x1               \n"
                  "MOV x4, x2               \n"
                  "MOV x5, x1               \n"
                  "MOV x6, x2               \n"
                  "MOV x7, x1               \n"
                  "MOV x8, x2               \n"

                  "loop1:                   \n"

//                "STMIA x0!, {x1-x8}       \n"
                  "STP x1, x2, [x0], #16    \n"
                  "STP x3, x4, [x0], #16    \n"
                  "STP x5, x6, [x0], #16    \n"
                  "STP x7, x8, [x0], #16    \n"

//                "STMIA x0!, {x1-x8}       \n"
                  "STP x1, x2, [x0], #16    \n"
                  "STP x3, x4, [x0], #16    \n"
                  "STP x5, x6, [x0], #16    \n"
                  "STP x7, x8, [x0], #16    \n"

//                "STMIA x0!, {x1-x8}       \n"
                  "STP x1, x2, [x0], #16    \n"
                  "STP x3, x4, [x0], #16    \n"
                  "STP x5, x6, [x0], #16    \n"
                  "STP x7, x8, [x0], #16    \n"

//                "STMIA x0!, {x1-x8}       \n"
                  "STP x1, x2, [x0], #16    \n"
                  "STP x3, x4, [x0], #16    \n"
                  "STP x5, x6, [x0], #16    \n"
                  "STP x7, x8, [x0], #16    \n"

                  "SUBS x10, x10, #256      \n"
                  "BGE loop1                \n"

//                "POP {x2-x8}              \n"
                  "LDP x2, x3, [sp], #16    \n"
                  "LDP x4, x5, [sp], #16    \n"
                  "LDP x6, x7, [sp], #16    \n"
                  "LDP x8, x9, [sp], #16    \n"
                  ::[addr]    "r" (addr),
                    [pattern] "r" (pattern),
                    [bufsize] "r" (bufsize)
                  : "x0", "x1", "x10");
}

/**
* @brief test_noiseburst.
* @par Test Description
*   Verifies r/w while forcing switching of all data bus lines.
*   optimised write loop witrh store multiple to use burst
*   for pattern and inversed pattern.
* @par Test Hardware Connection
* - None
* @par Required preconditions
* - None
* @par Expected result
* - None
* @par Called functions
* - xxx
* @par Used Peripherals
* - None,...
* @retval
*  0: Test passed
*  Value different from 0: Test failed
*  None(0xFF): if the result is deduced by the user: waveform, event...
*/
uint32_t DDR_Test_NoiseBurst(unsigned long size_in, unsigned long pattern_in,
                             unsigned long addr_in)
{
  unsigned long pattern;
  uintptr_t *addr = NULL;
  unsigned long bufsize;
  unsigned long data;
  unsigned long i;

  if (get_buf_size(size_in, &bufsize, 4 * 1024, 128) != 0)
  {
    return 1;
  }

  get_pattern(pattern_in, &pattern, 0xFFFFFFFF);

  if (get_addr(addr_in, &addr) != 0)
  {
    return 2;
  }

  do_noiseburst((unsigned long)addr, pattern, bufsize);

  for (i = 0; i < bufsize / sizeof(unsigned long);)
  {
    data = *(addr + i);
    if (data != pattern)
    {
      if (!silent_console)
      {
        printf("  %s KO @ 0x%lx\n\r", __func__, (unsigned long)(addr + i));
        printf("  read 0x%lx instead of 0x%lx\n\r", data, pattern);
      }
      return 3;
    }

    i++;

    data = *(addr + i);
    if (data != ~pattern)
    {
      if (!silent_console)
      {
        printf("  %s KO @ 0x%lx\n\r", __func__, (unsigned long)(addr + i));
        printf("  read 0x%lx instead of 0x%lx\n\r", data, pattern);
      }
      return 4;
    }

    i++;
  }

  return 0;
}

/**
* @brief test_random.
* @par Test Description
*   Verifies r/w with pseudo-ramdom value on one region
*   + write the region (individual access)
*   + memcopy to the 2nd region (try to use burst)
*   + verify the 2 regions
* @par Test Hardware Connection
* - None
* @par Required preconditions
* - None
* @par Expected result
* - None
* @par Called functions
* - xxx
* @par Used Peripherals
* - None,...
* @retval
*  0: Test passed
*  Value different from 0: Test failed
*  None(0xFF): if the result is deduced by the user: waveform, event...
*/
uint32_t DDR_Test_Random(unsigned long size_in, unsigned long loop_in,
                         unsigned long addr_in)
{
  unsigned long value = 0;
  unsigned long data;
  unsigned long offset;
  uintptr_t *addr = NULL;
  unsigned long error = 0U;
  uint32_t loop = 0;
  uint32_t nb_loop;
  unsigned long bufsize_bytes;
  unsigned long bufsize_words;
  unsigned int seed;

  if (get_buf_size(size_in, &bufsize_bytes, 4 * 1024, 8) != 0)
  {
    return 1;
  }

  get_nb_loop(loop_in, &nb_loop, 10);

  if (get_addr(addr_in, &addr) != 0)
  {
    return 2;
  }

  bufsize_bytes /= 2;
  bufsize_words = bufsize_bytes/sizeof(unsigned long);

  while (error == 0U)
  {
    seed = rand();
    srand(seed);

    for (offset = 0; offset < bufsize_words; offset ++)
    {
      data = rand();
      *(addr + offset) = data;
    }

    memcpy((void *)((unsigned long)addr + bufsize_bytes), addr, bufsize_bytes);

    srand(seed);

    for (offset = 0; offset < (2 * bufsize_words); offset ++)
    {
      if (offset == bufsize_words)
      {
        srand(seed);
      }

