danngreen/STM32DDRFW-UTIL/DDR_Tool/Common_MP2/Src/ddr_tests.c
      value = rand();
      data = *(addr + offset);
      if (data != value)
      {
        error++;
        if (!silent_console)
        {
          printf("  loop %d: error @ 0x%lx: 0x%lx expected 0x%lx\n\r",
                 loop, (unsigned long)(addr + offset), data, value);
	}
        break;
      }
    }

    if (test_loop_end(&loop, nb_loop))
    {
      break;
    }
  }

  if (error != 0U)
  {
    if (!silent_console)
    {
      printf("  %s KO\n\r", __func__);
    }
    return 3;
  }

  return 0;
}

#define DDR_PATTERN_SIZE  8

/* pattern test, optimized loop for read/write pattern (array of 8 u32) */
static void test_loop_in(const unsigned long *pattern, unsigned long offset,
                         unsigned long testsize)
{
  __asm volatile (
//                "PUSH {x3-x10}            \n"
                  "STP x3, x4, [sp, #-16]!  \n"
                  "STP x5, x6, [sp, #-16]!  \n"
                  "STP x7, x8, [sp, #-16]!  \n"
                  "STP x9, x10, [sp, #-16]! \n"

                  "MOV x0, %[pattern]       \n"
                  "MOV x1, %[offset]        \n"
                  "MOV x2, %[testsize]      \n"

//                "LDMIA x0!, {x3-x10}      \n"
                  "LDP x3, x4, [x0], #16    \n"
                  "LDP x5, x6, [x0], #16    \n"
                  "LDP x7, x8, [x0], #16    \n"
                  "LDP x9, x10, [x0], #16   \n"

                  "loop2:                   \n"

//                "STMIA x1!, {x3-x10}      \n"
                  "STP x3, x4, [x1], #16    \n"
                  "STP x5, x6, [x1], #16    \n"
                  "STP x7, x8, [x1], #16    \n"
                  "STP x9, x10, [x1], #16   \n"

//                "STMIA x1!, {x3-x10}      \n"
                  "STP x3, x4, [x1], #16    \n"
                  "STP x5, x6, [x1], #16    \n"
                  "STP x7, x8, [x1], #16    \n"
                  "STP x9, x10, [x1], #16   \n"

//                "STMIA x1!, {x3-x10}      \n"
                  "STP x3, x4, [x1], #16    \n"
                  "STP x5, x6, [x1], #16    \n"
                  "STP x7, x8, [x1], #16    \n"
                  "STP x9, x10, [x1], #16   \n"

//                "STMIA x1!, {x3-x10}      \n"
                  "STP x3, x4, [x1], #16    \n"
                  "STP x5, x6, [x1], #16    \n"
                  "STP x7, x8, [x1], #16    \n"
                  "STP x9, x10, [x1], #16   \n"

                  "SUBS x2, x2, #256        \n"
                  "BGE loop2                \n"

//                "POP {x3-x10}             \n"
                  "LDP x3, x4, [sp], #16    \n"
                  "LDP x5, x6, [sp], #16    \n"
                  "LDP x7, x8, [sp], #16    \n"
                  "LDP x9, x10, [sp], #16   \n"
                    ::[pattern]  "r" (pattern),
                      [offset]   "r" (offset),
                      [testsize] "r" (testsize)
                    : "x0", "x1", "x2");
}

static int test_loop(const unsigned long *pattern, uintptr_t *address,
                     const unsigned long bufsize)
{
  unsigned long i;
  int j;
  unsigned long offset;
  unsigned long testsize;
  unsigned long remaining;

  offset = (unsigned long)address;
  remaining = bufsize;

  while (remaining)
  {
    testsize = bufsize > 0x1000000 ? 0x1000000 : bufsize;

    test_loop_in(pattern, offset, testsize);

    offset += testsize;
    remaining -= testsize;
  }

  offset = 0;

  for (i = 0; i < bufsize / sizeof(unsigned long); i += DDR_PATTERN_SIZE)
  {
    for (j = 0; j < DDR_PATTERN_SIZE; j++, offset++)
    {
      if (*(address + offset) != pattern[j])
      {
        if (!silent_console)
        {
          printf("  %s KO @ 0x%lx\n\r", __func__, (unsigned long)(address + offset));
	}
        return 1;
      }
    }
  }

  return 0;
}

const unsigned long pattern_div1_x16[DDR_PATTERN_SIZE] = {
  0x0000FFFF0000FFFF, 0x0000FFFF0000FFFF, 0x0000FFFF0000FFFF, 0x0000FFFF0000FFFF,
  0x0000FFFF0000FFFF, 0x0000FFFF0000FFFF, 0x0000FFFF0000FFFF, 0x0000FFFF0000FFFF
};

const unsigned long pattern_div2_x16[DDR_PATTERN_SIZE] = {
  0xFFFFFFFFFFFFFFFF, 0x0000000000000000, 0xFFFFFFFFFFFFFFFF, 0x0000000000000000,
  0xFFFFFFFFFFFFFFFF, 0x0000000000000000, 0xFFFFFFFFFFFFFFFF, 0x0000000000000000
};

const unsigned long pattern_div4_x16[DDR_PATTERN_SIZE] = {
  0xFFFFFFFFFFFFFFFF, 0xFFFFFFFFFFFFFFFF, 0x0000000000000000, 0x0000000000000000,
  0xFFFFFFFFFFFFFFFF, 0xFFFFFFFFFFFFFFFF, 0x0000000000000000, 0x0000000000000000
};

const unsigned long pattern_div4_x32[DDR_PATTERN_SIZE] = {
  0xFFFFFFFFFFFFFFFF, 0xFFFFFFFFFFFFFFFF, 0xFFFFFFFFFFFFFFFF, 0xFFFFFFFFFFFFFFFF,
  0x0000000000000000, 0x0000000000000000, 0x0000000000000000, 0x0000000000000000
};

const unsigned long pattern_mostly_zero_x16[DDR_PATTERN_SIZE] = {
  0x0000000000000000, 0x0000000000000000, 0x0000000000000000, 0x0000FFFF0000FFFF,
  0x0000000000000000, 0x0000000000000000, 0x0000000000000000, 0x0000000000000000
};

const unsigned long pattern_mostly_zero_x32[DDR_PATTERN_SIZE] = {
  0x0000000000000000, 0x0000000000000000, 0x0000000000000000, 0xFFFFFFFFFFFFFFFF,
  0x0000000000000000, 0x0000000000000000, 0x0000000000000000, 0x0000000000000000
};

const unsigned long pattern_mostly_one_x16[DDR_PATTERN_SIZE] = {
  0xFFFFFFFFFFFFFFFF, 0xFFFFFFFFFFFFFFFF, 0xFFFFFFFFFFFFFFFF, 0x0000FFFF0000FFFF,
  0xFFFFFFFFFFFFFFFF, 0xFFFFFFFFFFFFFFFF, 0xFFFFFFFFFFFFFFFF, 0xFFFFFFFFFFFFFFFF
};

const unsigned long pattern_mostly_one_x32[DDR_PATTERN_SIZE] = {
  0xFFFFFFFFFFFFFFFF, 0xFFFFFFFFFFFFFFFF, 0xFFFFFFFFFFFFFFFF, 0x0000000000000000,
  0xFFFFFFFFFFFFFFFF, 0xFFFFFFFFFFFFFFFF, 0xFFFFFFFFFFFFFFFF, 0xFFFFFFFFFFFFFFFF
};

#define DDR_NB_PATTERN                      5
#define DDRCTRL_MSTR_DATA_BUS_WIDTH_HALF    DDRC_MSTR_DATA_BUS_WIDTH_0
#define DDRCTRL_MSTR_DATA_BUS_WIDTH_QUARTER DDRC_MSTR_DATA_BUS_WIDTH_1

/**
* @brief test_freqpattern.
* @par Test Description
*   Frequency Selective Pattern Test.
*   Stress data bus by performing successive write 8-word burst
*   operations using mostly zero/one patterns and frequency divider
*   patterns (F/1, F/2, F/4) for 16 and 32 data bus width.
* @par Test Hardware Connection
* - None
* @par Required preconditions
* - None
* @par Expected result
* - None
* @par Called functions
* - xxx
* @par Used Peripherals
* - None,...
* @retval
*  0: Test passed
*  Value different from 0: Test failed
*  None(0xFF): if the result is deduced by the user: waveform, event...
*/
uint32_t DDR_Test_FrequencySelectivePattern(unsigned long size,
                                            unsigned long addr_in)
{
  const unsigned long * const patterns_x16[DDR_NB_PATTERN] = {
    pattern_div1_x16,
    pattern_div2_x16,
    pattern_div4_x16,
    pattern_mostly_zero_x16,
    pattern_mostly_one_x16,
  };
  const unsigned long * const patterns_x32[DDR_NB_PATTERN] = {
    pattern_div2_x16,
    pattern_div4_x16,
    pattern_div4_x32,
    pattern_mostly_zero_x32,
    pattern_mostly_one_x32
  };

