danngreen/STM32DDRFW-UTIL/DDR_Tool/Common_MP2/Src/ddr_tests.c
  int i;
  int bus_width;
  int ret = 0;
  const unsigned long **patterns;
  unsigned long bufsize;
  uintptr_t *addr = NULL;

  if (get_buf_size(size, &bufsize, 4 * 1024, 128) != 0)
  {
    return 1;
  }

  if (get_addr(addr_in, &addr) != 0)
  {
    return 2;
  }

  switch (READ_REG(DDRC->MSTR) & DDRC_MSTR_DATA_BUS_WIDTH_Msk)
  {
    case DDRCTRL_MSTR_DATA_BUS_WIDTH_HALF:
    case DDRCTRL_MSTR_DATA_BUS_WIDTH_QUARTER:
      bus_width = 16;
      break;
    default:
      bus_width = 32;
      break;
  }

  patterns = (const unsigned long **)(bus_width == 16 ? patterns_x16 : patterns_x32);

  for (i = 0; i < DDR_NB_PATTERN; i++)
  {
    ret = test_loop(patterns[i], addr, bufsize);
    if (ret != 0)
    {
      if (!silent_console)
      {
        printf("  %s KO\n\r", __func__);
      }
      return 3;
    }
  }

  return 0;
}

/* pattern test with size, loop for write pattern */
static int test_loop_size(const unsigned long *pattern, unsigned long size,
                          uintptr_t *address, const unsigned long bufsize,
                          __attribute__((unused))uint32_t loop_nb,
                          __attribute__((unused))uint32_t loop)
{
  unsigned long i, j;
  uintptr_t *addr = (uintptr_t *)address;

  for (i = 0; i < bufsize / sizeof(unsigned long); i += size)
  {
    for (j = 0; j < size ; j++, addr++)
    {
      *addr = pattern[j];
    }

  }

  addr = address;
  for (i = 0; i < bufsize / sizeof(unsigned long); i += size)
  {
    for (j = 0; j < size; j++, addr++)
    {
      if (*addr != pattern[j])
      {
        if (!silent_console)
        {
          printf("  test KO @ 0x%lx\n\r", (unsigned long)addr);
	}
        return 1;
      }
    }
  }

  return 0;
}

/**
* @brief test_blockseq.
* @par Test Description
*   Block Sequential Test.
*   Test incremental pattern.
* @par Test Hardware Connection
* - None
* @par Required preconditions
* - None
* @par Expected result
* - None
* @par Called functions
* - xxx
* @par Used Peripherals
* - None,...
* @retval
*  0: Test passed
*  Value different from 0: Test failed
*  None(0xFF): if the result is deduced by the user: waveform, event...
*/
uint32_t DDR_Test_BlockSequential(unsigned long size, unsigned long loop_in,
                                  unsigned long addr_in)
{
  unsigned long bufsize;
  uint32_t nb_loop;
  uint32_t loop = 0;
  uintptr_t *addr = NULL;
  unsigned long value;
  unsigned long i;
  int ret;

  if (get_buf_size(size, &bufsize, 4 * 1024, sizeof(unsigned long)) != 0)
  {
    return 1;
  }

  get_nb_loop(loop_in, &nb_loop, 1);

  if (get_addr(addr_in, &addr) != 0)
  {
    return 2;
  }

  while (1)
  {
    for (i = 0; i < 256; i++)
    {
      value = i | i << 8 | i << 16 | i << 24 | i << 32 | i << 40 | i << 48 | i << 56;
      ret = test_loop_size(&value, 1, addr, bufsize, 256, i);
      if (ret != 0)
      {
        if (!silent_console)
        {
          printf("  %s KO\n\r", __func__);
	}
        return 3;
      }
    }

    if (test_loop_end(&loop, nb_loop))
    {
      break;
    }
  }

  return 0;
}

/**
* @brief test_checkboard.
* @par Test Description
*   Checker board test.
*   Test checker pattern.
* @par Test Hardware Connection
* - None
* @par Required preconditions
* - None
* @par Expected result
* - None
* @par Called functions
* - xxx
* @par Used Peripherals
* - None,...
* @retval
*  0: Test passed
*  Value different from 0: Test failed
*  None(0xFF): if the result is deduced by the user: waveform, event...
*/
uint32_t DDR_Test_Checkerboard(unsigned long size, unsigned long loop_in,
                               unsigned long addr_in)
{
  unsigned long bufsize;
  uint32_t nb_loop;
  uint32_t loop = 0;
  uintptr_t *addr = NULL;
  unsigned long checkboard[2];
  int i;
  int ret;

  checkboard[0] = 0x5555555555555555;
  checkboard[1] = 0xAAAAAAAAAAAAAAAA;

  if (get_buf_size(size, &bufsize, 4 * 1024, 8) != 0)
  {
    return 1;
  }

  get_nb_loop(loop_in, &nb_loop, 1);

  if (get_addr(addr_in, &addr) != 0)
  {
    return 2;
  }

  while (1)
  {
    for (i = 0; i < 2; i++)
    {
      ret = test_loop_size(checkboard, 2, addr, bufsize, 2, i);
      if (ret != 0)
      {
        if (!silent_console)
        {
          printf("  %s KO\n\r", __func__);
	}
        return 3;
      }

      checkboard[0] = ~checkboard[0];
      checkboard[1] = ~checkboard[1];
    }

    if (test_loop_end(&loop, nb_loop))
    {
      break;
    }
  }

  return 0;
}

/**
* @brief test_bitspread.
* @par Test Description
*   Test Bit Spread pattern.
*   Try to catch bad bits which are dependent on the current values of
*   surrounding bits in either the same word32.
* @par Test Hardware Connection
* - None
* @par Required preconditions
* - None
* @par Expected result
* - None
* @par Called functions
* - xxx
* @par Used Peripherals
* - None,...
* @retval
*  0: Test passed
*  Value different from 0: Test failed
*  None(0xFF): if the result is deduced by the user: waveform, event...
*/
uint32_t DDR_Test_BitSpread(unsigned long size, unsigned long loop_in,
                            unsigned long addr_in)
{
  unsigned long bufsize;
  uint32_t nb_loop;
  uint32_t loop = 0;
  uintptr_t *addr = NULL;
  unsigned long bitspread[4];
  int i;
  int j;
  int ret;

  if (get_buf_size(size, &bufsize, 4 * 1024, 32) != 0)
  {
    return 1;
  }

  get_nb_loop(loop_in, &nb_loop, 1);

  if (get_addr(addr_in, &addr) != 0)
  {
    return 2;
  }

  while (1)
  {
    for (i = 1; i < (int)(sizeof(unsigned long) * 8); i++)
    {
      for (j = 0; j < i; j++)
      {
        if (i < 32)
        {
          bitspread[0] = (1 << i) | (1 << j);
        }
        else
        {
          bitspread[0] = (1 << (63 - i)) | (1 << (63 - j));
        }

        bitspread[1] = bitspread[0];
        bitspread[2] = ~bitspread[0];
        bitspread[3] = ~bitspread[0];

        ret = test_loop_size(bitspread, 4, addr, bufsize, 32, i);
        if (ret != 0)
        {
          if (!silent_console)
          {
            printf("  %s KO\n\r", __func__);
          }
          return 3;
        }
      }
    }

    if (test_loop_end(&loop, nb_loop))
    {
      break;
    }
  }

