danngreen/STM32DDRFW-UTIL/DDR_Tool/Common_MP2/Src/ddr_tests.c
  return 0;
}

/**
* @brief test_bitflip.
* @par Test Description
*   Test Bit Flip pattern.
* @par Test Hardware Connection
* - None
* @par Required preconditions
* - None
* @par Expected result
* - None
* @par Called functions
* - xxx
* @par Used Peripherals
* - None,...
* @retval
*  0: Test passed
*  Value different from 0: Test failed
*  None(0xFF): if the result is deduced by the user: waveform, event...
*/
uint32_t DDR_Test_BitFlip(unsigned long size, unsigned long loop_in,
                          unsigned long addr_in)
{
  unsigned long bufsize;
  uint32_t nb_loop;
  uint32_t loop = 0;
  uintptr_t *addr = NULL;
  unsigned long bitflip[4];
  int i;
  int ret;

  if (get_buf_size(size, &bufsize, 4 * 1024, 32) != 0)
  {
    return 1;
  }

  get_nb_loop(loop_in, &nb_loop, 1);

  if (get_addr(addr_in, &addr) != 0)
  {
    return 2;
  }

  while (1)
  {
    for (i = 0; i < (int)(sizeof(unsigned long) * 8); i++)
    {
      bitflip[0] = 1 << i;
      bitflip[1] = bitflip[0];
      bitflip[2] = ~bitflip[0];
      bitflip[3] = bitflip[2];

      ret = test_loop_size(bitflip, 4, addr, bufsize, 32, i);
      if (ret != 0)
      {
        if (!silent_console)
        {
          printf("  %s KO\n\r", __func__);
        }
        return 3;
      }
    }

    if (test_loop_end(&loop, nb_loop))
    {
      break;
    }
  }

  return 0;
}

/**
* @brief test_walkbit0.
* @par Test Description
*   Test Walking Zeroes pattern
* @par Test Hardware Connection
* - None
* @par Required preconditions
* - None
* @par Expected result
* - None
* @par Called functions
* - xxx
* @par Used Peripherals
* - None,...
* @retval
*  0: Test passed
*  Value different from 0: Test failed
*  None(0xFF): if the result is deduced by the user: waveform, event...
*/
uint32_t DDR_Test_WalkingZeroes(unsigned long size, unsigned long loop_in,
                                unsigned long addr_in)
{
  unsigned long bufsize;
  uint32_t nb_loop;
  uint32_t loop = 0;
  uintptr_t *addr = NULL;
  unsigned long value;
  int i;
  int ret;
  int depth;

  if (get_buf_size(size, &bufsize, 4 * 1024, sizeof(unsigned long)) != 0)
  {
    return 1;
  }

  get_nb_loop(loop_in, &nb_loop, 1);

  if (get_addr(addr_in, &addr) != 0)
  {
    return 2;
  }

  depth = sizeof(unsigned long) * 8;

  while (1)
  {
    for (i = 0; i < depth * 2 ; i++)
    {
      if (i < depth)
      {
        value = 1 << i;
      }
      else
      {
        value = 1 << ((depth * 2) - 1 - i);
      }

      ret = test_loop_size(&value, 1, addr, bufsize, (depth * 2) -1, i);
      if (ret != 0)
      {
        if (!silent_console)
        {
          printf("  %s KO\n\r", __func__);
        }
        return 3;
      }
    }

    if (test_loop_end(&loop, nb_loop))
    {
      break;
    }
  }

  return 0;
}

/**
* @brief test_walkbit1.
* @par Test Description
*   Test Walking Ones pattern.
* @par Test Hardware Connection
* - None
* @par Required preconditions
* - None
* @par Expected result
* - None
* @par Called functions
* - xxx
* @par Used Peripherals
* - None,...
* @retval
*  0: Test passed
*  Value different from 0: Test failed
*  None(0xFF): if the result is deduced by the user: waveform, event...
*/
uint32_t DDR_Test_WalkingOnes(unsigned long size, unsigned long loop_in,
                              unsigned long addr_in)
{
  unsigned long bufsize;
  uint32_t nb_loop;
  uint32_t loop = 0;
  uintptr_t *addr = NULL;
  unsigned long value;
  int i;
  int ret;
  int depth;

  if (get_buf_size(size, &bufsize, 4 * 1024, sizeof(unsigned long)) != 0)
  {
    return 1;
  }

  get_nb_loop(loop_in, &nb_loop, 1);

  if (get_addr(addr_in, &addr) != 0)
  {
    return 2;
  }

  depth = sizeof(unsigned long) * 8;

  while (1)
  {
    for (i = 0; i < depth * 2; i++)
    {
      if (i < depth)
      {
        value = ~(1 << i);
      }
      else
      {
        value = ~(1 << ((depth * 2) - 1 - i));
      }

      ret = test_loop_size(&value, 1, addr, bufsize, (depth * 2) - 1, i);
      if (ret != 0)
      {
        if (!silent_console)
        {
          printf("  %s KO\n\r", __func__);
        }
        return 3;
      }
    }

    if (test_loop_end(&loop, nb_loop))
    {
      break;
    }
  }

  return 0;
}

#define MAX_DMA_CHANNEL 12

/**
* @brief test DMA stress
* @par Test Description
*   Stress DDR using DMA transfers
* @par Test Hardware Connection
* - None
* @par Required preconditions
* - None
* @par Expected result
* - None
* @par Called functions
* - xxx
* @par Used Peripherals
* - None,...
* @retval
*  0: Test passed
*  Value different from 0: Test failed
*  None(0xFF): if the result is deduced by the user: waveform, event...
*/
uint32_t HAL_DDR_Test_DMA_Stress(unsigned long size_in, unsigned long loop_in,
                                 unsigned long nb_channel)
{
  unsigned long i = 0;
  unsigned long addr_in[MAX_DMA_CHANNEL];
  unsigned long addr_out[MAX_DMA_CHANNEL];
  unsigned long data;
  unsigned long value;
  unsigned long offset;
  unsigned long bufsize;
  unsigned int seed;
  uint32_t nb_loop;
  uint64_t value64;
  DMA_RepeatBlockConfTypeDef RepeatBlockConfig = {0};
  DMA_HandleTypeDef handle_HPDMA_Channel[MAX_DMA_CHANNEL];
  uint32_t hal_status = HAL_OK;

  if (get_buf_size(size_in, &bufsize, 4 * 1024, 4) != 0)
  {
    return 1;
  }

  get_nb_loop(loop_in, &nb_loop, 1);

  if (nb_channel == 0)
  {
    nb_channel = 1;
  }

  if (nb_channel > 12)
  {
    if (!silent_console)
    {
      printf("Invalid channel number [1..12]: 0x%lx\n\r", nb_channel);
    }
    return 2;
  }

  if (bufsize > (64 * 1024) - 4)
  {
    if (!silent_console)
    {
      printf("Invalid size: 0x%lx\n\r", bufsize);
      printf("Max size = 64 Kbytes - 4 = 65532\n\r");
    }
    return 3;
  }

  if (nb_loop > 2047)
  {
    if (!silent_console)
    {
#ifdef __AARCH64__
      printf("Invalid repeat block number : 0x%x\n\r", nb_loop);
#else
      printf("Invalid repeat block number : 0x%lx\n\r", nb_loop);
#endif
      printf("Max value = 2047\n\r");
    }
    return 4;
  }

  addr_in[0] = DDR_MEM_BASE;
  addr_out[0] = addr_in[0] + (nb_channel * nb_loop * bufsize);

  value64 = addr_out[0] + (nb_channel * nb_channel * nb_loop * bufsize);
  if (value64 > (uint64_t)(DDR_MEM_SIZE + DDR_MEM_BASE -1))
  {
    if (!silent_console)
    {
#ifdef __AARCH64__
      printf("Address exceed memory boundary  : 0x%lx\n\r", value64);
#else
      printf("Address exceed memory boundary  : 0x%llx\n\r", value64);
#endif
    }
    return 5;
  }

  /* DMA configuration */

  /* Peripheral clock enable */
  __HAL_RCC_HPDMA1_CLK_ENABLE();
  __HAL_RCC_HPDMA2_CLK_ENABLE();
  __HAL_RCC_HPDMA3_CLK_ENABLE();

  /* Define DMA channels to use */
  handle_HPDMA_Channel[0].Instance = HPDMA1_Channel12;
  handle_HPDMA_Channel[1].Instance = HPDMA1_Channel13;
  handle_HPDMA_Channel[2].Instance = HPDMA1_Channel14;
  handle_HPDMA_Channel[3].Instance = HPDMA1_Channel15;
  handle_HPDMA_Channel[4].Instance = HPDMA2_Channel12;
  handle_HPDMA_Channel[5].Instance = HPDMA2_Channel13;
  handle_HPDMA_Channel[6].Instance = HPDMA2_Channel14;
  handle_HPDMA_Channel[7].Instance = HPDMA2_Channel15;
  handle_HPDMA_Channel[8].Instance = HPDMA3_Channel12;
  handle_HPDMA_Channel[9].Instance = HPDMA3_Channel13;
  handle_HPDMA_Channel[10].Instance = HPDMA3_Channel14;
  handle_HPDMA_Channel[11].Instance = HPDMA3_Channel15;

  /* DMA channels init */
  for (i = 0; i < nb_channel; i++)
  {
    hal_status = HAL_DMA_ConfigChannelAttributes(&handle_HPDMA_Channel[i],
                                                 (DMA_CHANNEL_CID_STATIC_1 | DMA_CHANNEL_PRIV |
                                                  DMA_CHANNEL_SEC | DMA_CHANNEL_DEST_SEC |
                                                  DMA_CHANNEL_SRC_SEC));
    if (hal_status != HAL_OK)
    {
      if (!silent_console)
      {
        printf("HAL_DMA_ConfigChannelAttributes error\n\r");
      }
      return 6;
    }

    handle_HPDMA_Channel[i].Init.Request = DMA_REQUEST_SW;
    handle_HPDMA_Channel[i].Init.BlkHWRequest = DMA_BREQ_BLOCK;
    handle_HPDMA_Channel[i].Init.Direction = DMA_MEMORY_TO_MEMORY;
    handle_HPDMA_Channel[i].Init.SrcInc = DMA_SINC_INCREMENTED;
    handle_HPDMA_Channel[i].Init.DestInc = DMA_DINC_INCREMENTED;
    handle_HPDMA_Channel[i].Init.SrcDataWidth = DMA_SRC_DATAWIDTH_WORD; /* No AXI DWORD */
    handle_HPDMA_Channel[i].Init.DestDataWidth = DMA_DEST_DATAWIDTH_WORD; /* No AXI DWORD */
    handle_HPDMA_Channel[i].Init.Priority = DMA_HIGH_PRIORITY;
    handle_HPDMA_Channel[i].Init.SrcBurstLength = 16; /* PVA  64 byte burst */
    handle_HPDMA_Channel[i].Init.DestBurstLength = 16;
    handle_HPDMA_Channel[i].Init.Mode = DMA_NORMAL;
    handle_HPDMA_Channel[i].Init.TransferEventMode = DMA_TCEM_REPEATED_BLOCK_TRANSFER;

