danngreen/STM32DDRFW-UTIL/DDR_Tool/Common_MP2/Src/ddr_tests.c
    /* AXI port selection */
    handle_HPDMA_Channel[i].Init.TransferAllocatedPort = DMA_SRC_ALLOCATED_PORT0 |
                                                         DMA_DEST_ALLOCATED_PORT0;

    if (HAL_DMA_Init(&handle_HPDMA_Channel[i]) != HAL_OK)
    {
      if (!silent_console)
      {
        printf("HAL_DMA_Init error\n\r");
      }
      return 7;
    }

    HPDMA1->SECCFGR = 0x0000FFFF;
    HPDMA2->SECCFGR = 0x0000FFFF; /* control DMA is secure */
    HPDMA3->SECCFGR = 0x0000FFFF; /* control DMA is secure */
    handle_HPDMA_Channel[i].Instance->CTR1 |= 0x80008000;
    HPDMA1->PRIVCFGR = 0x0000FFFF;
    HPDMA2->PRIVCFGR = 0x0000FFFF;
    HPDMA3->PRIVCFGR = 0x0000FFFF;

    RepeatBlockConfig.RepeatCount = 1024;
    RepeatBlockConfig.SrcAddrOffset = 0;
    RepeatBlockConfig.DestAddrOffset = 0;
    RepeatBlockConfig.BlkSrcAddrOffset = 0;
    RepeatBlockConfig.BlkDestAddrOffset = 0;
    if (HAL_DMAEx_ConfigRepeatBlock(&handle_HPDMA_Channel[i],
                                    &RepeatBlockConfig) != HAL_OK)
    {
      printf("HAL_DMAEx_ConfigRepeatBlock error\n\r");
      return 1;
    }
  }

  /* DDR security configuration (RISAF4) */
  WRITE_REG(RISAF4->CR, 0x00000000); /* Disable */
  WRITE_REG(RISAF4->REG[0].STARTR, DDR_MEM_BASE); /* Region 0 start address */
  WRITE_REG(RISAF4->REG[0].ENDR, (uint32_t)(DDR_MEM_SIZE - 1)); /* Region 0 end address */
  WRITE_REG(RISAF4->REG[0].CIDCFGR, 0x00FF00FF); /* Allow accesses from every compartment */
  WRITE_REG(RISAF4->REG[0].CFGR, 0x0000101); /* Secure and base regions enable */

  /* Init buffers to transfer */
  for (i = 0; i < nb_channel; i++)
  {
    unsigned long bufsize_words;

    seed = rand();
    srand(seed);

    bufsize_words = bufsize/sizeof(unsigned long);

    addr_in[i] = addr_in[0] + (bufsize * nb_loop * i);
    addr_out[i] = addr_out[0] + (bufsize * nb_loop * i);
    handle_HPDMA_Channel[i].Instance->CBR1 &= 0x1FFFF; /* Nb of repeated block */

    for (offset = 0; offset < bufsize_words; offset ++)
    {
      data = rand();
      *(unsigned long *)(addr_in[i] + offset) = data;
    }
  }

  /* Start buffers transfer DDR to DDR */
  for (i = 0; i < nb_channel; i++)
  {
    handle_HPDMA_Channel[i].Instance->CBR1 |= nb_loop << 16;
  }

  for (i = 0; i < nb_channel; i++)
  {
    hal_status = HAL_DMA_Start(&handle_HPDMA_Channel[i], (uint32_t)addr_in[i],
                               (uint32_t)addr_out[i], bufsize);
    if (hal_status != HAL_OK)
    {
      if (!silent_console)
      {
        printf("HAL_DMA_Start error\n\r");
      }
      return 10;
    }
  }

  for (i = 0; i < nb_channel; i++)
  {
    hal_status = HAL_DMA_PollForTransfer(&handle_HPDMA_Channel[i],
                            HAL_DMA_FULL_TRANSFER, 1000); /* Low timeout */
    if (hal_status != HAL_OK)
    {
      if (!silent_console)
      {
        printf("HAL_DMA_PollForTransfer error\n\r");
      }
      return 11;
    }
  }

  /* Check data */
  for (i = 0; i < nb_channel; i++)
  {
    bool exit = false;
    for (offset = 0; offset < (nb_loop*bufsize); offset += sizeof(uint32_t))
    {
      value = *(unsigned long *)(addr_in[i] + offset);
      data = *(unsigned long *)(addr_out[i] + offset);
      if (data != value)
      {
        if (!silent_console)
        {
          printf("  error @ 0x%lx:value  0x%lx expected 0x%lx\n\r",
                 addr_out[i] + offset, value, data);
	}
	exit = true;
        break;
      }
    }

    if (exit)
    {
      break;
    }
  }

  return 0;
}

#ifdef TEST_INFINITE_ENABLE
/**
* @brief test infinite write access to DDR
* @par Test Description
*   Continuous write the same pattern at the same address
* @par Test Hardware Connection
* - None
* @par Required preconditions
* - None
* @par Expected result
* - None
* @par Called functions
* - xxx
* @par Used Peripherals
* - None,...
* @retval
*  0: Test passed
*  Value different from 0: Test failed
*  None(0xFF): if the result is deduced by the user: waveform, event...
*/
uint32_t DDR_Test_Infinite_write(unsigned long pattern_in, unsigned long addr_in)
{
  uintptr_t *addr = NULL;
  unsigned long data;
  uint32_t loop = 0;
  uint32_t nb_loop = 0xFFFFFFFFU;
  int i, size = 1024 * 1024;
  bool random = false;
  volatile uint32_t go_loop = 1U;
  unsigned long dflt_pattern = 0xA5A5AA55AAAA5555;

  if (get_addr(addr_in, &addr) != 0)
  {
    return 1;
  }

  get_pattern(pattern_in, &data, dflt_pattern);

  if ((unsigned long)addr == 0xC8888888)
  {
    printf("running random\n\r");
    random = true;
  }
  else
  {
    printf("running at 0x%lx with pattern 0x%lx\n\r", (unsigned long)addr, data);
  }

  while (go_loop != 0U)
  {
    for (i = 0; i < size; i++)
    {
      if (random)
      {
        addr = (uintptr_t *)(unsigned long)((rand() & (DDR_MEM_SIZE - 1) & ~0x3));
        data = rand();
      }

      *addr = data;
    }

    if (test_loop_end(&loop, nb_loop))
    {
      break;
    }
  }

  return 0;
}

/**
* @brief test infinite read access to DDR
* @par Test Description
*   Continuous read the same pattern at the same address
* @par Test Hardware Connection
* - None
* @par Required preconditions
* - None
* @par Expected result
* - None
* @par Called functions
* - xxx
* @par Used Peripherals
* - None,...
* @retval
*  0: Test passed
*  Value different from 0: Test failed
*  None(0xFF): if the result is deduced by the user: waveform, event...
*/
uint32_t DDR_Test_Infinite_read(unsigned long pattern_in, unsigned long addr_in)
{
  uintptr_t *addr = NULL;
  unsigned long data;
  uint32_t loop = 0;
  uint32_t nb_loop = 0xFFFFFFFFU;
  int i, size = 1024 * 1024;
  bool random = false;
  volatile uint32_t go_loop = 1U;
  unsigned long dflt_pattern = 0xA5A5AA55AAAA5555;

  if (get_addr(addr_in, &addr) != 0)
  {
    return 1;
  }

  get_pattern(pattern_in, &data, dflt_pattern);

  if ((unsigned long)addr == 0xC8888888)
  {
    printf("running random\n\r");
    random = true;
  }
  else
  {
    printf("running at 0x%lx with pattern 0x%lx\n\r", (unsigned long)addr, data);
    *addr = data;
  }

  while (go_loop != 0U)
  {
    for (i = 0; i < size; i++)
    {
      if (random)
        addr = (uintptr_t *)(unsigned long)((rand() & (DDR_MEM_SIZE - 1) & ~0x3));

