danngreen/STM32DDRFW-UTIL/DDR_Tool/Common_MP2/Src/ddr_tests.c
      data = *addr;
      printf("data @ address 0x%lx = 0x%lx \n\r", (unsigned long)addr, data);
    }

    if (test_loop_end(&loop, nb_loop))
    {
      break;
    }
  }

  return 0;
}
#endif

/*
 * Some impedance values can be excluded from ComputeDelayMargins scenarios.
 * Globally extreme values that brings high/low current intensities.
 * Min/Max indexes correspond to constant arrays defined in the DDR driver.
 */
#define TX_ZPHY_NAME "TX"
#define MIN_TX_ZPHY_IDX 2 /* TX 30 Ohms */
#define MAX_TX_ZPHY_IDX 4 /* TX 60 Ohms */
#define MAX_TX_ZPHY_CASES (MAX_TX_ZPHY_IDX - MIN_TX_ZPHY_IDX + 1)
#if STM32MP_DDR3_TYPE
#define TX_ZMEM_NAME "RTTWR"
#define MIN_TX_ZMEM_IDX 0 /* RTTWR disabled */
#define MAX_TX_ZMEM_IDX 2 /* RTTWR120 Ohms */
#elif STM32MP_DDR4_TYPE
#define TX_ZMEM_NAME "RTTNOM"
#define MIN_TX_ZMEM_IDX 1 /* RTTNOM 34 Ohms */
#define MAX_TX_ZMEM_IDX 5 /* RTTNOM 80 Ohms */
#else /* STM32MP_LPDDR4_TYPE */
#define TX_ZMEM_NAME "DQODT"
#define MIN_TX_ZMEM_IDX 1 /* DQODT 40 Ohms */
#define MAX_TX_ZMEM_IDX 4 /* DQODT 80 Ohms */
#endif
#define MAX_TX_ZMEM_CASES (MAX_TX_ZMEM_IDX - MIN_TX_ZMEM_IDX + 1)
#define MAX_DATA_TX_CASES (MAX_TX_ZPHY_CASES * MAX_TX_ZMEM_CASES)

#define RX_ZPHY_NAME "ODT"
#define MIN_RX_ZPHY_IDX 4  /* ODT 37 Ohms */
#define MAX_RX_ZPHY_IDX 14 /* ODT 160 Ohms */
#define MAX_RX_ZPHY_CASES (MAX_RX_ZPHY_IDX - MIN_RX_ZPHY_IDX + 1)
#if STM32MP_DDR3_TYPE
#define RX_ZMEM_NAME "RON"
#define MIN_RX_ZMEM_IDX 0 /* RON 34 Ohms */
#define MAX_RX_ZMEM_IDX 1 /* RON 40 Ohms */
#elif STM32MP_DDR4_TYPE
#define RX_ZMEM_NAME "ODI"
#define MIN_RX_ZMEM_IDX 0 /* ODI 34 Ohms */
#define MAX_RX_ZMEM_IDX 1 /* ODI 48 Ohms */
#else /* STM32MP_LPDDR4_TYPE */
#define RX_ZMEM_NAME "PDDS"
#define MIN_RX_ZMEM_IDX 0 /* PDDS 40 Ohms */
#define MAX_RX_ZMEM_IDX 3 /* PDDS 80 Ohms */
#endif
#define MAX_RX_ZMEM_CASES (MAX_RX_ZMEM_IDX - MIN_RX_ZMEM_IDX + 1)
#define MAX_DATA_RX_CASES (MAX_RX_ZPHY_CASES * MAX_RX_ZMEM_CASES)

#define MAXI(a, b) ((a) > (b) ? (a) : (b))
uint32_t delay_margins[MAXI(MAX_TX_ZPHY_CASES, MAX_RX_ZPHY_CASES)]
                      [MAXI(MAX_TX_ZMEM_CASES, MAX_RX_ZMEM_CASES)] = { 0 };

#define TX_DELAY_MARGINS 1
#define RX_DELAY_MARGINS 2

#ifdef STM32MP_DDR_16_BIT_INTERFACE
#define NB_DQS 2
#else /* !STM32MP_DDR_16_BIT_INTERFACE */
#define NB_DQS 4
#endif /* STM32MP_DDR_16_BIT_INTERFACE */

#define DDRPHYC_RXCLKDLY_OFFSET        0x40230
#define DDRPHYC_TXDQSDLY_OFFSET        0x40340
#define DDRPHYC_MICROCONTMUXSEL_OFFSET 0x340000

#define DDRPHYC_RXCLKDLY_MASK          0x3F
#define DDRPHYC_TXDQSDLY_MASK          0x3FF

#define DDRPHYC_DBYTE_OFFSET           0x4000

static uint32_t get_min_zphy_idx(uint32_t mode)
{
  if (mode == TX_DELAY_MARGINS)
  {
    return MIN_TX_ZPHY_IDX;
  }
  else /* RX_DELAY_MARGINS */
  {
    return MIN_RX_ZPHY_IDX;
  }
}

static uint32_t get_max_zphy_idx(uint32_t mode)
{
  if (mode == TX_DELAY_MARGINS)
  {
    return MAX_TX_ZPHY_IDX;
  }
  else /* RX_DELAY_MARGINS */
  {
    return MAX_RX_ZPHY_IDX;
  }
}

static uint32_t get_min_zmem_idx(uint32_t mode)
{
  if (mode == TX_DELAY_MARGINS)
  {
    return MIN_TX_ZMEM_IDX;
  }
  else /* RX_DELAY_MARGINS */
  {
    return MIN_RX_ZMEM_IDX;
  }
}

static uint32_t get_max_zmem_idx(uint32_t mode)
{
  if (mode == TX_DELAY_MARGINS)
  {
    return MAX_TX_ZMEM_IDX;
  }
  else /* RX_DELAY_MARGINS */
  {
    return MAX_RX_ZMEM_IDX;
  }
}

static uint32_t get_max_zmem_cases(uint32_t mode)
{
  if (mode == TX_DELAY_MARGINS)
  {
    return MAX_TX_ZMEM_CASES;
  }
  else /* RX_DELAY_MARGINS */
  {
    return MAX_RX_ZMEM_CASES;
  }
}

static uint32_t get_max_data_cases(uint32_t mode)
{
  if (mode == TX_DELAY_MARGINS)
  {
    return MAX_DATA_TX_CASES;
  }
  else /* RX_DELAY_MARGINS */
  {
    return MAX_DATA_RX_CASES;
  }
}

static uint32_t *get_zphy_ohms_pointer(uint32_t mode)
{
  if (mode == TX_DELAY_MARGINS)
  {
    return (uint32_t *)&tx_ohms[0];
  }
  else /* RX_DELAY_MARGINS */
  {
    return (uint32_t *)&odt_ohms[0];
  }
}

static uint32_t *get_zmem_ohms_pointer(uint32_t mode)
{
  if (mode == TX_DELAY_MARGINS)
  {
#if STM32MP_DDR3_TYPE
    return (uint32_t *)&rttwr_ohms[0];
#elif STM32MP_DDR4_TYPE
    return (uint32_t *)&rttnom_ohms[0];
#else /* STM32MP_LPDDR4_TYPE */
    return (uint32_t *)&dqodt_ohms[0];
#endif
  }
  else /* RX_DELAY_MARGINS */
  {
#if STM32MP_DDR3_TYPE
    return (uint32_t *)&ron_ohms[0];
#elif STM32MP_DDR4_TYPE
    return (uint32_t *)&odi_ohms[0];
#else /* STM32MP_LPDDR4_TYPE */
    return (uint32_t *)&pdds_ohms[0];
#endif
  }
}

static void get_zphy_name(uint32_t mode, char *name)
{
  if (mode == TX_DELAY_MARGINS)
  {
    sprintf(name, "%s%c", TX_ZPHY_NAME, (char)'\0');
  }
  else /* RX_DELAY_MARGINS */
  {
    sprintf(name, "%s%c", RX_ZPHY_NAME, (char)'\0');
  }
}

static void get_zmem_name(uint32_t mode, char *name)
{
  if (mode == TX_DELAY_MARGINS)
  {
    sprintf(name, "%s%c", TX_ZMEM_NAME, (char)'\0');
  }
  else /* RX_DELAY_MARGINS */
  {
    sprintf(name, "%s%c", RX_ZMEM_NAME, (char)'\0');
  }
}

static void Remote_Do_Step(HAL_DDR_InteractStepTypeDef step)
{
  /* Only manages STEP_DDR_READY <-> STEP_DDR_RESET transitions */
  remote_argc = 2;
  remote_cmd = 9; /* DDR_CMD_STEP */
  if (step == STEP_DDR_RESET)
  {
    remote_argv0[0] = '0'; /* STEP_DDR_RESET */
  }
  else
  {
    remote_argv0[0] = '3'; /* STEP_DDR_READY */
  }
  remote_argv0[1] = '\0';
  remote_argv1[0] = '\0';
}

static bool Remote_Do_Impedance_Write(char *name, uint32_t value)
{
  remote_argc = 3;
  remote_cmd = 5; /* DDR_CMD_IMPEDANCE */
  sprintf(remote_argv0, "%s%c", name, (char)'\0');
  sprintf(remote_argv1, "0x%08X", value);
  return HAL_DDR_Interactive(STEP_DDR_RESET);
}

static bool Remote_Do_Impedance_Read(char *name)
{
  remote_argc = 2;
  remote_cmd = 5; /* DDR_CMD_IMPEDANCE */
  sprintf(remote_argv0, "%s%c", name, (char)'\0');
  sprintf(remote_argv1, "%c", (char)'\0');
  return HAL_DDR_Interactive(STEP_DDR_READY);
}

static uint32_t read_dly(uint32_t mode, uint32_t idx)
{
  uint32_t result;

  if (mode == TX_DELAY_MARGINS)
  {
    /* read_txdqsdly */
    WRITE_REG(*(volatile uint32_t *)(DDRPHYC_BASE + DDRPHYC_MICROCONTMUXSEL_OFFSET), 0U);
    result = READ_REG(*(volatile uint32_t *)(DDRPHYC_BASE + DDRPHYC_TXDQSDLY_OFFSET +
                                             (idx * DDRPHYC_DBYTE_OFFSET)));
    WRITE_REG(*(volatile uint32_t *)(DDRPHYC_BASE + DDRPHYC_MICROCONTMUXSEL_OFFSET), 1U);
  }
  else /* RX_DELAY_MARGINS */
  {
    /* read_rxclkdly */
    WRITE_REG(*(volatile uint32_t *)(DDRPHYC_BASE + DDRPHYC_MICROCONTMUXSEL_OFFSET), 0U);
    result = READ_REG(*(volatile uint32_t *)(DDRPHYC_BASE + DDRPHYC_RXCLKDLY_OFFSET +
                                             (idx * DDRPHYC_DBYTE_OFFSET)));
    WRITE_REG(*(volatile uint32_t *)(DDRPHYC_BASE + DDRPHYC_MICROCONTMUXSEL_OFFSET), 1U);
  }

  return result;
}

static bool write_dly(uint32_t mode, uint32_t idx, uint32_t value)
{
  if (mode == TX_DELAY_MARGINS)
  {
    /* write_txdqsdly */
    WRITE_REG(*(volatile uint32_t *)(DDRPHYC_BASE + DDRPHYC_MICROCONTMUXSEL_OFFSET), 0U);
    WRITE_REG(*(volatile uint32_t *)(DDRPHYC_BASE + DDRPHYC_TXDQSDLY_OFFSET +
                                     (idx * DDRPHYC_DBYTE_OFFSET)), value);
    WRITE_REG(*(volatile uint32_t *)(DDRPHYC_BASE + DDRPHYC_MICROCONTMUXSEL_OFFSET), 1U);

