danngreen/STM32DDRFW-UTIL/DDR_Tool/Common_MP2/Src/ddr_tests.c
    if ((value <= 1) || (value >= (DDRPHYC_TXDQSDLY_MASK -1)))
    {
      return false;
    }
  }
  else /* RX_DELAY_MARGINS */
  {
    /* write_rxclkdly */
    WRITE_REG(*(volatile uint32_t *)(DDRPHYC_BASE + DDRPHYC_MICROCONTMUXSEL_OFFSET), 0U);
    WRITE_REG(*(volatile uint32_t *)(DDRPHYC_BASE + DDRPHYC_RXCLKDLY_OFFSET +
                                     (idx * DDRPHYC_DBYTE_OFFSET)), value);
    WRITE_REG(*(volatile uint32_t *)(DDRPHYC_BASE + DDRPHYC_MICROCONTMUXSEL_OFFSET), 1U);

    if ((value <= 1) || (value >= (DDRPHYC_RXCLKDLY_MASK -1)))
    {
      return false;
    }
  }

  return true;
}

static uint32_t TestDelayMargins(void)
{
  return DDR_Test_All(0, 0, 0);
}

static uint32_t ComputeDelayMargins(uint32_t mode)
{
  uint32_t test_id = 0;
  uint32_t idx = 0;
  uint32_t zphy_idx = 0;
  uint32_t zmem_idx = 0;
  uint32_t dqs_idx;
  uint32_t ret = 0;
  uint32_t *zphy_ohms = get_zphy_ohms_pointer(mode);
  uint32_t *zmem_ohms = get_zmem_ohms_pointer(mode);
  char zphy_name[8] = "\0";
  char zmem_name[8] = "\0";

  get_zphy_name(mode, zphy_name);
  get_zmem_name(mode, zmem_name);

  test_id = mode;
  save_test_id = mode;

  /*
   * Check if test has been interrupted to process step/impedance commands.
   * If yes, restore indexes and jump to continue processing.
   */
  if (stage_in_test != 0)
  {
    test_id = save_test_id;
    idx = save_idx;
    zphy_idx = save_zphy_idx;
    zmem_idx = save_zmem_idx;

    if (stage_in_test == 1)
    {
      /* Jump after first step transition (STEP_DDR_READY -> STEP_DDR_RESET) */
      goto stage_in_test_1;
    }
    if (stage_in_test == 2)
    {
      /* Jump after second step transition (STEP_DDR_RESET -> STEP_DDR_READY) */
      goto stage_in_test_2;
    }
    if (stage_in_test == 3)
    {
      /* Jump after third step transition (STEP_DDR_READY -> STEP_DDR_RESET) */
      goto stage_in_test_3;
    }
    if (stage_in_test == 4)
    {
      /* Jump after fourth step transition (STEP_DDR_RESET -> STEP_DDR_READY) */
      goto stage_in_test_4;
    }
  }

  silent_console = true;

  /*
   * Read impedance values before starting the algorithm.
   * They will be restored after the processing.
   */
  if (!initial_done)
  {
    if (Remote_Do_Impedance_Read(zphy_name))
    {
      printf("impedance %s read error\n\r", zphy_name);
      ret = 1;
      goto computedelaymargins_end;
    }
    initial_zphy = remote_impedance;

    if (Remote_Do_Impedance_Read(zmem_name))
    {
      printf("impedance %s read error\n\r", zmem_name);
      ret = 1;
      goto computedelaymargins_end;
    }
    initial_zmem = remote_impedance;

    initial_done = true;
  }

  for (zphy_idx = get_min_zphy_idx(test_id);
       zphy_idx <= get_max_zphy_idx(test_id);
       zphy_idx++)
  {
    for (zmem_idx = get_min_zmem_idx(test_id);
	 zmem_idx <= get_max_zmem_idx(test_id);
	 zmem_idx++)
    {
      idx = ((zphy_idx - get_min_zphy_idx(test_id)) * get_max_zmem_cases(test_id)) +
            (zmem_idx - get_min_zmem_idx(test_id));

      printf("case %02u/%02u:  %s = %03u Ohms, %s = %03u Ohms\n\r",
             idx + 1, get_max_data_cases(test_id), zphy_name, zphy_ohms[zphy_idx],
             zmem_name, zmem_ohms[zmem_idx]);

      /* Go to RESET state, necessary to change settings */
      Remote_Do_Step(STEP_DDR_RESET);

      /* Save indexes before the next execution break during step change */
      save_test_id = test_id;
      save_idx = idx;
      save_zphy_idx = zphy_idx;
      save_zmem_idx = zmem_idx;
      stage_in_test = 1;
      return 0;

stage_in_test_1:
      stage_in_test = 0;

      /* Set all impedances according to loop indexes */
      if (!Remote_Do_Impedance_Write(zphy_name, zphy_ohms[zphy_idx]) ||
          !Remote_Do_Impedance_Write(zmem_name, zmem_ohms[zmem_idx]))
      {
        printf("impedance write error\n\r");
        ret = 1;
        goto computedelaymargins_end;
      }

      /* Go back to READY state, necessary to make tests */
      Remote_Do_Step(STEP_DDR_READY);

      /* New execution break during step change */
      stage_in_test = 2;
      return 0;

stage_in_test_2:
      stage_in_test = 0;

      if (TestDelayMargins() != 0)
      {
        printf("current impedance configuration not functional\n\r");
        continue;
      }

      delay_margins[zphy_idx - get_min_zphy_idx(test_id)]
                   [zmem_idx - get_min_zmem_idx(test_id)] = 0;

      for (dqs_idx = 0; dqs_idx < NB_DQS; dqs_idx++)
      {
        uint32_t dly;
        uint32_t inc_dly_offset = 0;
        uint32_t dec_dly_offset = 0;
        bool failure_detected = false;

        /* read initial DQS delay generated by the training */
        dly = read_dly(test_id, dqs_idx);

        /* Get delay margin by incrementation */
        do
        {
          inc_dly_offset += 2;
          if (!write_dly(test_id, dqs_idx, dly + inc_dly_offset))
          {
            /* The high limit is reached, end the parsing */
            failure_detected = true;
          }

          valid_delay_us(1000);

          if (TestDelayMargins() != 0)
          {
            inc_dly_offset--;
            write_dly(test_id, dqs_idx, dly + inc_dly_offset);

            if (TestDelayMargins() != 0)
            {
              inc_dly_offset--;
            }

            failure_detected = true;
          }
        }
        while (!failure_detected);

        /* restore initial DQS delay generated by the training */
        write_dly(test_id, dqs_idx, dly);

        failure_detected = false;

        /* Get delay margin by decrementation */
        do
        {
          dec_dly_offset += 2;
          if (!write_dly(test_id, dqs_idx, dly - dec_dly_offset))
          {
            /* The low limit is reached, end the parsing */
            failure_detected = true;
          }

          valid_delay_us(1000);

          if (TestDelayMargins() != 0)
          {
            dec_dly_offset--;
            write_dly(test_id, dqs_idx, dly - dec_dly_offset);

            if (TestDelayMargins() != 0)
            {
              dec_dly_offset--;
            }

            failure_detected = true;
          }
        }
        while (!failure_detected);

        /* restore initial DQS delay generated by the training */
        write_dly(test_id, dqs_idx, dly);

        if (inc_dly_offset > dec_dly_offset)
        {
          delay_margins[zphy_idx - get_min_zphy_idx(test_id)]
                       [zmem_idx - get_min_zmem_idx(test_id)] +=
          dec_dly_offset;
        }
        else
        {
          delay_margins[zphy_idx - get_min_zphy_idx(test_id)]
                       [zmem_idx - get_min_zmem_idx(test_id)] +=
          inc_dly_offset;
        }
      } /* dqs_idx */
    } /* zmem_idx */
  } /* zphy_idx */

  /* Display results in a 2D eye diagram */
  printf ("\n\r %s |\n\r", zphy_name);

