danngreen/STM32DDRFW-UTIL/DDR_Tool/Common_MP2/Src/ddr_tests.c
  for (zphy_idx = get_min_zphy_idx(test_id);
       zphy_idx <= (get_max_zphy_idx(test_id) + 3);
       zphy_idx++)
  {
    char output[64] = "\0";

    if (zphy_idx >= (get_max_zphy_idx(test_id) + 1))
    {
      sprintf(output, "     ");

      if (zphy_idx >= (get_max_zphy_idx(test_id) + 2))
      {
        sprintf(output + strlen(output), " ");
      }
      else
      {
        sprintf(output + strlen(output), "|");
      }
    }
    else
    {
      sprintf(output, " %03u |", zphy_ohms[zphy_idx]);
    }

    for (zmem_idx = get_min_zmem_idx(test_id);
         zmem_idx <= get_max_zmem_idx(test_id);
         zmem_idx++)
    {
      if (zphy_idx == (get_max_zphy_idx(test_id) + 3))
      {
        sprintf(output + strlen(output), " %s", zmem_name);
	break;
      }
      else if (zphy_idx == (get_max_zphy_idx(test_id) + 2))
      {
        sprintf(output + strlen(output), " %03u  ", zmem_ohms[zmem_idx]);
      }
      else if (zphy_idx == (get_max_zphy_idx(test_id) + 1))
      {
        sprintf(output + strlen(output), "______");
      }
      else
      {
        sprintf(output + strlen(output), "  %02u  ",
                delay_margins[zphy_idx - get_min_zphy_idx(test_id)]
                             [zmem_idx - get_min_zmem_idx(test_id)]);
      }
    } /* zmem_idx */

    printf("%s\n\r", output);
  } /* zphy_idx */

  /* Restore initial impedance values */
  /* Go to RESET state, necessary to change settings */
  Remote_Do_Step(STEP_DDR_RESET);

  stage_in_test = 3;
  return 0;

stage_in_test_3:
  stage_in_test = 0;

  if (!Remote_Do_Impedance_Write(zphy_name, initial_zphy) ||
      !Remote_Do_Impedance_Write(zmem_name, initial_zmem))
  {
    printf("impedance write error\n\r");
    ret = 1;
    goto computedelaymargins_end;
  }

  /* Go back to READY state, necessary to make tests */
  Remote_Do_Step(STEP_DDR_READY);

  /* New execution break during step change */
  stage_in_test = 4;
  return 0;

stage_in_test_4:
  stage_in_test = 0;

computedelaymargins_end:
  silent_console = false;
  save_test_id = 0;
  initial_done = false;

  return ret;
}

/**
* @brief test_txcomputedelaymargins
* @par Test Description
*   Compute TX DQS delay margins with present impedances.
* @par Test Hardware Connection
* - None
* @par Required preconditions
* - None
* @par Expected result
* - None
* @par Called functions
* - xxx
* @par Used Peripherals
* - None,...
* @retval
*  0: Test passed
*  Value different from 0: Test failed
*  None(0xFF): if the result is deduced by the user: waveform, event...
*/
uint32_t DDR_Test_TXComputeDelayMargins(void)
{
  return ComputeDelayMargins(TX_DELAY_MARGINS);
}

/**
 * @brief test_rxcomputedelaymargins
 * @par Test Description
 *   Compute RX DQS to RxClk delay margins with present impedances.
 * @par Test Hardware Connection
 * - None
 * @par Required preconditions
 * - None
 * @par Expected result
 * - None
 * @par Called functions
 * - xxx
 * @par Used Peripherals
 * - None,...
 * @retval
 *  0: Test passed
 *  Value different from 0: Test failed
 *  None(0xFF): if the result is deduced by the user: waveform, event...
*/
uint32_t DDR_Test_RXComputeDelayMargins(void)
{
  return ComputeDelayMargins(RX_DELAY_MARGINS);
}
